{
  "_name_or_path": "./saves/pretrain",
  "architectures": [
    "LLM"
  ],
  "attention_bias": false,
  "dropout": 0.0,
  "flash_attn": true,
  "hidden_size": 512,
  "intermediate_size": 2048,
  "max_seq_len": 512,
  "mlp_bias": false,
  "model_type": "small_model",
  "n_layers": 8,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0",
  "vocab_size": 6400
}
